app/Controllers/Api/FlowDataController.php

    public function handle()
    {
        $envelope = $this->request->getJSON(true) ?? [];

        $encryptedFlowData = $envelope['encrypted_flow_data'] ?? null;
        $encryptedAesKey   = $envelope['encrypted_aes_key']   ?? null;
        $initialVector     = $envelope['initial_vector']      ?? null;

        if (!$encryptedFlowData || !$encryptedAesKey || !$initialVector) {
            return $this->response->setStatusCode(400)->setJSON(['error' => 'Missing encrypted fields']);
        }

        // Public endpoint, no session. This app currently manages a single
        // active WhatsApp connection at a time, so the first row's key pair
        // is the one Meta encrypted against.
        $waConfig = (new WhatsAppConfigModel())->first();
---
SELECT *
FROM `whatsapp_config`
 LIMIT 1