app/Controllers/Api/InboxController.php

SELECT *
FROM `conversations`
WHERE `conversations`.`account_id` = '52a7341a-812f-4ba4-8b1c-6fdd74a6fb05'
AND `account_id` = '52a7341a-812f-4ba4-8b1c-6fdd74a6fb05'
AND `conversations`.`id` = 'da1e1dca-cc48-44fc-b698-31f885df6595'
---
    public function messages(string $conversationId)
    {
        $conversationModel = new ConversationModel();
        $conversation      = $conversationModel->where('account_id', session('account_id'))->find($conversationId);