app/Libraries/WhatsApp/TemplateSubmitter.php

    public function submit(array $template, string $accountId): string
    {
        $waConfig = (new WhatsAppConfigModel())->where('account_id', $accountId)->first();
---
SELECT *
FROM `whatsapp_config`
WHERE `whatsapp_config`.`account_id` = '52a7341a-812f-4ba4-8b1c-6fdd74a6fb05'
AND `account_id` = '52a7341a-812f-4ba4-8b1c-6fdd74a6fb05'
 LIMIT 1