app/Filters/AccountFilter.php

SELECT *
FROM `profiles`
WHERE `user_id` = '603894b8-1dc4-429e-a6c5-1a820de4aa8d'
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $path   = trim(uri_string(), '/');
        $userId = session('user_id');

        if (!$userId) {
            return;
        }

        foreach ($this->skipRoutes as $route) {
            if ($path === $route || str_starts_with($path, $route)) {
                return;
            }
        }

        ProfileModel::setBypassAccountScope(true);
        $profile = (new ProfileModel())->where('user_id', $userId)->first();