app/Filters/AuthFilter.php

        if ((time() - $lastSeen) > 300) {
            try {
                $profileModel = new \App\Models\ProfileModel();
                $profileModel->where('user_id', session('user_id'))->set(['last_seen_at' => date('Y-m-d H:i:s')])->update();
---
UPDATE `profiles` SET `last_seen_at` = '2026-07-06 18:49:25', `updated_at` = '2026-07-06 18:49:25'
WHERE `profiles`.`account_id` = '52a7341a-812f-4ba4-8b1c-6fdd74a6fb05'
AND `user_id` = '603894b8-1dc4-429e-a6c5-1a820de4aa8d'