app/Controllers/TemplatesController.php

SELECT *
FROM `whatsapp_config`
WHERE `whatsapp_config`.`account_id` = '52a7341a-812f-4ba4-8b1c-6fdd74a6fb05'
AND `account_id` = '52a7341a-812f-4ba4-8b1c-6fdd74a6fb05'
 LIMIT 1
---
    public function index()
    {
        $model = new MessageTemplateModel();

        // Templates belong to a specific WABA. Switching connected WhatsApp
        // accounts must not surface a previous account's templates — filter
        // to whichever WABA is currently connected.
        $waConfig = (new \App\Models\WhatsAppConfigModel())->where('account_id', session('account_id'))->first();

SELECT *
FROM `message_templates`
WHERE `message_templates`.`account_id` = '52a7341a-812f-4ba4-8b1c-6fdd74a6fb05'
AND `account_id` = '52a7341a-812f-4ba4-8b1c-6fdd74a6fb05'
AND `name` = 'rovix_promo'
AND `language` = 'en'
 LIMIT 1
SELECT *
FROM `whatsapp_config`
WHERE `whatsapp_config`.`account_id` = '52a7341a-812f-4ba4-8b1c-6fdd74a6fb05'
AND `account_id` = '52a7341a-812f-4ba4-8b1c-6fdd74a6fb05'
 LIMIT 1
INSERT INTO `message_templates` (`account_id`, `waba_id`, `name`, `language`, `category`, `header_type`, `header_content`, `body_text`, `footer_text`, `buttons`, `sample_values`, `status`, `created_at`, `updated_at`, `id`) VALUES ('52a7341a-812f-4ba4-8b1c-6fdd74a6fb05', '1023743710554755', 'rovix_promo', 'en', 'marketing', 'none', NULL, 'Hi {{1}}! 👋\r\n\r\nManaging leads on WhatsApp manually? RovixAI CRM automates it all —\r\n✅ Auto-capture leads\r\n✅ Instant follow-ups\r\n✅ Broadcasts & pipelines in one dashboard\r\n\r\nBusinesses using RovixAI close deals 3x faster 🚀', 'Reply STOP to unsubscribe', '[{\"type\":\"QUICK_REPLY\",\"text\":\"Interested\",\"url\":\"\",\"phone\":\"\"},{\"type\":\"QUICK_REPLY\",\"text\":\"Not Interested\",\"url\":\"\",\"phone\":\"\"}]', '{\"body\":[\"jhon\"]}', 'draft', '2026-07-06 18:48:33', '2026-07-06 18:48:33', '51c73964-dee6-452e-8ad0-c5d083be2837')
---
    public function store()
    {
        $name = $this->request->getPost('name');
        if (!preg_match('/^[a-z0-9_]+$/', $name)) {
            return redirect()->back()->withInput()->with('error', 'Template name must be lowercase letters, numbers and underscores only.');
        }

        $bodyText = $this->request->getPost('body_text');
        if (empty($bodyText)) {
            return redirect()->back()->withInput()->with('error', 'Body text is required.');
        }

        $language = $this->request->getPost('language') ?: 'en';
        $model    = new MessageTemplateModel();
        $existing = $model->where('account_id', session('account_id'))
            ->where('name', $name)
            ->where('language', $language)
            ->first();
        if ($existing) {
            return redirect()->back()->withInput()->with('error', "A template named \"{$name}\" ({$language}) already exists. Meta requires unique template names — edit the existing one or pick a different name.");
        }

        $buttons        = $this->sanitizeButtons($this->request->getPost('buttons'));
        $sampleValues   = $this->request->getPost('sample_values') ?: null;
        $headerType     = $this->request->getPost('header_type') ?: 'none';
        $carouselCards  = $headerType === 'carousel' ? ($this->request->getPost('carousel_cards') ?: null) : null;

        $waConfig = (new \App\Models\WhatsAppConfigModel())->where('account_id', session('account_id'))->first();
        $id    = $model->insert([
            'account_id'     => session('account_id'),
            'waba_id'        => $waConfig['waba_id'] ?? null,
            'name'           => $name,
            'language'       => $language,
            'category'       => $this->request->getPost('category') ?: 'utility',
            'header_type'    => $headerType,
            'header_content' => $carouselCards ?? ($this->request->getPost('header_content') ?: null),
            'body_text'      => $bodyText,
            'footer_text'    => $this->request->getPost('footer_text') ?: null,
            'buttons'        => $buttons,
            'sample_values'  => $sampleValues,
            'status'         => 'draft',
            'created_at'     => date('Y-m-d H:i:s'),
        ]);

UPDATE `message_templates` SET `status` = 'pending', `meta_template_id` = '1456440449836902', `updated_at` = '2026-07-06 18:49:35'
WHERE `message_templates`.`id` IN ('51c73964-dee6-452e-8ad0-c5d083be2837')
---
    public function submitForApproval(string $templateId)
    {
        $model    = new MessageTemplateModel();
        $template = $model->find($templateId);
        if (!$template) return redirect()->to(base_url('templates'))->with('error', 'Template not found.');

        if (!in_array($template['status'], ['draft', 'rejected'])) {
            return redirect()->back()->with('error', 'Only draft or rejected templates can be submitted.');
        }

        try {
            $submitter      = new TemplateSubmitter();
            $metaTemplateId = $submitter->submit($template, session('account_id'));

            $model->update($templateId, [
                'status'           => 'pending',
                'meta_template_id' => $metaTemplateId,
                'updated_at'       => date('Y-m-d H:i:s'),
            ]);